Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_uart_cmsis.h
/*
 * Copyright (c) 2013-2016 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.

 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _FSL_UART_CMSIS_H_
#define _FSL_UART_CMSIS_H_

#include "fsl_common.h"
#include "Driver_USART.h"
#include "RTE_Device.h"
#include "fsl_uart.h"
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
#include "fsl_dmamux.h"
#endif
#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)
#include "fsl_uart_dma.h"
#endif
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
#include "fsl_uart_edma.h"
#endif

#if defined(UART0)
extern ARM_DRIVER_USART UART0_NonBlocking_Driver;
#endif /* UART0 */

#if defined(UART1)
extern ARM_DRIVER_USART UART1_NonBlocking_Driver;
#endif /* UART1 */

#if defined(UART2)
extern ARM_DRIVER_USART UART2_NonBlocking_Driver;
#endif /* UART2 */

#if defined(UART3)
extern ARM_DRIVER_USART UART3_NonBlocking_Driver;
#endif /* UART3 */

#if defined(UART4)
extern ARM_DRIVER_USART UART4_NonBlocking_Driver;
#endif /* UART4 */

#if defined(UART5)
extern ARM_DRIVER_USART UART5_NonBlocking_Driver;
#endif /* UART5 */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

#if defined(UART0)
extern ARM_DRIVER_USART UART0_Edma_Driver;
#endif /* UART0 */

#if defined(UART1)
extern ARM_DRIVER_USART UART1_Edma_Driver;
#endif /* UART1 */

#if defined(UART2)
extern ARM_DRIVER_USART UART2_Edma_Driver;
#endif /* UART2 */

#if defined(UART3)
extern ARM_DRIVER_USART UART3_Edma_Driver;
#endif /* UART3 */

#if defined(UART4)
extern ARM_DRIVER_USART UART4_Edma_Driver;
#endif /* UART4 */

#if defined(UART5)
extern ARM_DRIVER_USART UART5_Edma_Driver;
#endif /* UART5 */

#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

#if defined(UART0)
extern ARM_DRIVER_USART UART0_Dma_Driver;
#endif /* UART0 */

#if defined(UART1)
extern ARM_DRIVER_USART UART1_Dma_Driver;
#endif /* UART1 */

#if defined(UART2)
extern ARM_DRIVER_USART UART2_Dma_Driver;
#endif /* UART2 */

#if defined(UART3)
extern ARM_DRIVER_USART UART3_Dma_Driver;
#endif /* UART3 */

#if defined(UART4)
extern ARM_DRIVER_USART UART4_Dma_Driver;
#endif /* UART4 */

#if defined(UART5)
extern ARM_DRIVER_USART UART5_Dma_Driver;
#endif /* UART5 */

#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#endif /* _FSL_UART_CMSIS_H_ */
